{{- if eq .chezmoi.os "darwin" }}
# Brewfile for macOS
# Install with: brew bundle install
# Check status: brew bundle check
# Cleanup unused: brew bundle cleanup

# Taps (third-party repositories)
tap "wez/wezterm"

# Core tools
brew "git"
brew "curl"
brew "zsh"
brew "neovim"     # Modern vim-based editor
brew "tmux"       # Terminal multiplexer

# Version manager
brew "asdf"       # Runtime version manager (Node, Ruby, Python, etc.)

# Modern CLI tools
brew "eza"        # Modern ls replacement
brew "bat"        # Modern cat replacement
brew "fzf"        # Fuzzy finder
brew "zoxide"     # Smart cd replacement
brew "tldr"       # Simplified man pages
brew "glow"       # Terminal markdown renderer
brew "w3m"        # Terminal web browser
brew "poppler"    # PDF tools (provides pdftotext)

# Applications
cask "wezterm"    # Terminal emulator
{{- end }}
